InformationRegisters/ОчередьПечатиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьПечатиДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Напечатано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПринтера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьПечатиДокументов/Ext/ManagerModule.bsl
Функция ДобавитьТабличныйДокументВОчередь(Пользователь, ТабличныйДокумент, ТипДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Строка(Новый УникальныйИдентификатор());	
	
	Менеджер = РегистрыСведений.ОчередьПечатиДокументов.СоздатьМенеджерЗаписи();
	Менеджер.ДатаДобавления = ТекущаяДата();
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.Ответственный = Пользователь;
	Менеджер.ТабличныйДокумент = Новый ХранилищеЗначения(ТабличныйДокумент);
	Менеджер.ТипДокумента = ТипДокумента;
	Менеджер.Записать();
	
	Возврат Идентификатор;
		
КонецФункции 

Функция НапечататьДокумент(Идентификатор, ИмяПринтера) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.ОчередьПечатиДокументов.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.Прочитать();
	
	Если Менеджер.Выбран() Тогда
		
		Менеджер.ИмяПринтера = ИмяПринтера;
		Менеджер.Напечатано = Истина;
		Менеджер.ДатаПечати = ТекущаяДата();
		
	КонецЕсли;            
	
	Попытка
		
		ТабличныйДокумент = Менеджер.ТабличныйДокумент.Получить();      
		ТабличныйДокумент.ИмяПринтера = ИмяПринтера;
		ТабличныйДокумент.Напечатать(); 
		
		Менеджер.Записать(Истина);  
		
	Исключение
	    Сообщить("Возникла ошибка при печати: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Процедура НапечататьДокументыПоОтветственному(Ответственный, ИмяПринтера) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьПечатиДокументов.Идентификатор
	|ИЗ
	|	РегистрСведений.ОчередьПечатиДокументов КАК ОчередьПечатиДокументов
	|ГДЕ
	|	ОчередьПечатиДокументов.Ответственный = &Ответственный
	|	И НЕ ОчередьПечатиДокументов.Напечатано";
	
	Запрос.УстановитьПараметр("Ответственный", Ответственный);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		НапечататьДокумент(Выборка.Идентификатор, ИмяПринтера);	
	КонецЦикла;                                                
	
КонецПроцедуры
